API/app/controllers/api/v1/bus_positions_controller.rb

  def with_line_stops_and_positions
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'line'}) and return unless params[:line]
    begin
      line = Line.where(:line_number => params[:line]).last
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."line_number" = '10'  ORDER BY "lines"."id" DESC LIMIT 1

  def with_line_stops_positions_and_speed_avg
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'line'}) and return unless params[:line]
    begin
      line = Line.where(:line_number => params[:line]).last
---
SELECT  "lines".* FROM "lines"  WHERE "lines"."line_number" = '10'  ORDER BY "lines"."id" DESC LIMIT 1