API/app/controllers/api/v1/contatos_controller.rb

SELECT "contatos".* FROM "contatos"
---
  def all
    begin
      contatos = Contato.all

SELECT  "contatos".* FROM "contatos"  WHERE "contatos"."id" = $1 LIMIT 1  [["id", 1]]
---
  def fetch
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'id'}) and return unless params[:id]
    begin
      contato = Contato.find(params[:id])

INSERT INTO "contatos" ("created_at", "email", "name", "telephone", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-15 18:23:14.201358"], ["email", "walace@gmail.com"], ["name", "Wallace"], ["telephone", "387261317"], ["updated_at", "2014-12-15 18:23:14.201358"]]
---
  def insert
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'name'}) and return unless params[:name]
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'telephone'}) and return unless params[:telephone]
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'email'}) and return unless params[:email]
    begin
      contato = Contato.new
      contato.name = params[:name]
      contato.telephone = params[:telephone]
      contato.email = params[:email]

      contato.save!

SELECT  "contatos".* FROM "contatos"  WHERE "contatos"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "contatos" SET "email" = $1, "telephone" = $2, "updated_at" = $3 WHERE "contatos"."id" = 2  [["email", "diogo@gmail.com"], ["telephone", "222222222"], ["updated_at", "2014-12-15 18:28:56.932283"]]
---
  def atualiza
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'name'}) and return unless params[:name]
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'id'}) and return unless params[:id]
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'telephone'}) and return unless params[:telephone]
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'email'}) and return unless params[:email]
    begin
      contato = Contato.find(params[:id])
      contato.update_attributes(name: params[:name], telephone: params[:telephone], email: params[:email])