API/app/controllers/api/v1/dados_rj_controller.rb

  def from_current_week
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER, "line")}) and return unless params[:line]
    #begin
      line = Linha.where(:linha => params[:line]).last
---
SELECT `linhas`.* FROM `linhas` WHERE `linhas`.`linha` = '332' ORDER BY `linhas`.`id` DESC LIMIT 1

  def line_history
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'line'}) and return unless params[:line]
    begin
      line = Linha.where(:linha => params[:line]).last
---
SELECT `linhas`.* FROM `linhas` WHERE `linhas`.`linha` = '332' ORDER BY `linhas`.`id` DESC LIMIT 1

  def bus_history
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'bus'}) and return unless params[:bus]
    begin
      bus = Ordem.where(:ordem => params[:bus]).last

      respond_with({:code => HttpResponse::CODE_BUS_NOT_FOUND, :message => HttpResponse.code_msg(HttpResponse::CODE_BUS_NOT_FOUND)}) and return unless bus

      dados = DadoRj.where(:ordem_id => bus.id).includes(:linha).limit(5)
---
SELECT `linhas`.* FROM `linhas` WHERE `linhas`.`id` IN (410)