API/app/controllers/api/v1/line_positions_controller.rb

SELECT  "lines".* FROM "lines"  WHERE "lines"."line_number" = '10'  ORDER BY "lines"."id" DESC LIMIT 1
SELECT "line_positions".* FROM "line_positions"  WHERE "line_positions"."line_id" = 399  ORDER BY "line_positions"."shape_id" ASC, "line_positions"."sequence_number" ASC
SELECT  "lines".* FROM "lines"  WHERE "lines"."id" = $1 LIMIT 1  [["id", 399]]
SELECT "line_stops".* FROM "line_stops"  WHERE "line_stops"."line_id" = 399  ORDER BY "line_stops"."sequence_number" ASC
---
  def with_stops
    respond_with({:code => HttpResponse::CODE_ERROR_MISSING_PARAMETER, :message => HttpResponse.code_msg(HttpResponse::CODE_ERROR_MISSING_PARAMETER) + 'line'}) and return unless params[:line]
    begin
      line = Line.where(:line_number => params[:line]).last

      respond_with({:code => HttpResponse::CODE_LINE_NOT_FOUND, :message => HttpResponse.code_msg(HttpResponse::CODE_LINE_NOT_FOUND)}) and return unless line

      positions = LinePosition.where(:line_id => line.id).order([:shape_id,:sequence_number])
      bounding_box = LinePosition.bounding_box(line.id).first
      stops = LineStop.where(:line_id => line.id).order(:sequence_number)