API/app/controllers/heat_maps_controller.rb

SELECT "lines"."line_number" FROM "lines" INNER JOIN "line_positions" ON "line_positions"."line_id" = "lines"."id" GROUP BY line_number  ORDER BY "lines"."line_number" ASC
---
  def position
    @lines = Line.select(:line_number).joins(:line_positions).group(:line_number).order(:line_number).map(&:line_number)

SELECT "lines"."line_number" FROM "lines" INNER JOIN "line_positions" ON "line_positions"."line_id" = "lines"."id" GROUP BY line_number  ORDER BY "lines"."line_number" ASC
---
  def speed
    @lines = Line.select(:line_number).joins(:line_positions).group(:line_number).order(:line_number).map(&:line_number)