API/app/controllers/line_stops_controller.rb

  def index
    @lines = Line.select(:line_number).joins(:line_stops).group(:line_number).map(&:line_number)
---
SELECT "lines"."line_number" FROM "lines" INNER JOIN "line_stops" ON "line_stops"."line_id" = "lines"."id" GROUP BY line_number